Update README for submission requirements
